{
    "en": {
        "WELCOME_MESSAGE": "Welcome to ${restaurantName}, how can I help you today?",
        "BOOKING_SAVED": "Your reservation number is ${reservationNumber}.",
        "BOOKING_NOT_SAVED": "A technical issue occurred while saving your reservation. I apologize for the inconvenience and kindly ask you to call back later.",
        "CALLBACK_NOT_SAVED": "A technical issue occurred while saving your request. I apologize for the inconvenience and kindly ask you to call back later",
        "WAITING_LIST_NOT_SAVED": "A technical issue occurred while saving  your request for the waiting list. I apologize for the inconvenience and kindly ask you to call back later.",
        "BOOKING_NOT_CANCELLED": "A technical issue occurred while canceling your reservation. I apologize for the inconvenience and kindly ask you to call back later.",
        "NO_RESERVATION_HOLIDAY": "It is not possible to make a reservation for the date you requested as we are closed for ${holidayReason}.",
        "NO_RESERVATION_SPECIAL_EVENT": "For the date you requested, there is a special event scheduled ${specialEventName}, featuring ${specialEventDescription}. You can book directly from our website ${websiteUrl} or be called back by one of our operators. Do you want to be called back?",
        "NO_RESERVATION_OUT_OF_WORKING_HOURS": "It is not possible to make a reservation for ${bookingTime} on ${bookingDate} because the requested time is out of service hours.",
        "NO_RESERVATION_NO_AVAILABILITY": "Restaurant is not available for reservation at ${bookingTime} on ${bookingDate} because there is no availability of seats.",
        "NO_RESERVATION_OUT_OF_BOOKING_WINDOW": "Restaurant is not available for reservation at ${bookingTime} on ${bookingDate} because the requested time is out of service hours. Booking is only available between ${bookingStartTime} and ${bookingEndTime}.",
        "NO_RESERVATION_OUT_OF_BOOKING_WINDOW_LUNCH_DINNER": "Restaurant is not available for reservation at ${bookingTime} on ${bookingDate} because the requested time is out of service hours. Booking is only available the following slots: ${formattedTimeSlotsString}.",
        "NO_RESERVATION_NO_SEAT": "Unfortunately, we are fully booked and have no availability for ${bookingDate} at ${bookingTime}.",
        "RESTAURANT_CLOSED": "We are currently closed.",
        "RESTAURANT_OPEN": "We are currently open. ",
        "RESTAURANT_CLOSED_W_INFO": "We are currently closed. We are open for lunch from ${lunchOpen} to ${lunchClose} and for dinner from ${dinnerOpen} to ${dinnerClose}.",
        "FORMAT_EXISTING_BOOKINGS": "Please select your reservation from the following list. For example, say one for the first reservation or two for the second.",
        "BOOKING_NOT_UPDATED": "Unfortunately, due to a technical issue, your reservation has not been updated. I apologize for the inconvenience and kindly ask you to try again later.",
        "INVALIDATE_BOOKING_DATE": "You have provided a past date for the reservation.",
        "NO_HOLIDAY": "There are no upcoming holidays or vacation periods. ",
        "FORMAT_HOLIDAY": "Here are the upcoming holidays: ${holidays.name} on ${holidays.date } until ${holidays.endDate }",
        "BOOKING_FOUND_W_PHONE": "I found your reservation associated with the phone number ${customerPhone}.",
        "BOOKING_NOT_FOUND_W_PHONE": "Unfortunately, I could not find a reservation associated with the phone number ${customerPhone}.",
        "BOOKING_FOUND_W_DATE": "The booking with the booking date ${bookingDate} found.",
        "BOOKING_NOT_FOUND_W_DATE": "The booking with the booking date ${bookingDate} not found.",
        "BOOKING_FOUND_W_EMAIL": "I found your reservation associated with the email ${bookingEmail}.",
        "BOOKING_NOT_FOUND_W_EMAIL": "Unfortunately, I could not find a reservation associated with the email ${bookingEmail}.",
        "BOOKING_FOUND_W_NAME": "I found your reservation associated with the name ${bookingName}.",
        "BOOKING_NOT_FOUND_W_NAME": "Unfortunately, I could not find a reservation associated with the name ${bookingName}.",
        "BOOKING_FOUND_W_RESERVATION_NUMBER": "I found your reservation with the number ${reservation_number}. ",
        "BOOKING_NOT_FOUND_W_RESERVATION_NUMBER": "Unfortunately, I could not find the reservation with the number ${reservationNumber}.",
        "FORMAT_BOOKING_CANCELLATION_MODIFICATION": "Here are the options we found for your booking: ${formattedBookingOptions}, select only the one that has your information.",
        "CANCELLATION_CONFIRMATION": "Your reservation is for ${partySize} people on ${bookingDate} at ${startTime}. Do you want to confirm the cancellation?"
    },
    "it": {
        "WELCOME_MESSAGE": "Benvenuto al ${restaurantName}, come posso aiutarla oggi?",
        "BOOKING_SAVED": "Il suo numero di prenotazione è ${reservationNumber}.",
        "BOOKING_NOT_SAVED": "C’è stato un problema nel salvataggio della sua prenotazione. Mi scuso per il disguido e la invito a riprovare  più tardi",
        "CALLBACK_NOT_SAVED": "C’è stato un problema nel salvataggio della sua richiesta. Mi scuso per il disguido e la invito a richiamare più tardi.",
        "WAITING_LIST_NOT_SAVED": "C’è stato un problema nel salvataggio della sua richiesta per la lista d’attesa. Mi scuso per il disguido e la invito a richiamare più tardi.",
        "BOOKING_NOT_CANCELLED": "C’è stato un problema nella cancellazione della sua prenotazione. Mi scuso per il disguido e la invito a richiamare più tardi.",
        "NO_RESERVATION_HOLIDAY": "Non è possibile prenotare per la data da lei richiesta in quanto siamo chiusi per ${holiday.name}.",
        "NO_RESERVATION_SPECIAL_EVENT": "Per il giorno da lei richiesto è programmato un evento speciale ${specialEventName} che prevede un ${specialEventDescription}. La prenotazione si può effettuare dal nostro sito ${websiteUrl} oppure la posso far richiamare da un nostro operatore. Vuole essere richiamato?",
        "NO_RESERVATION_OUT_OF_WORKING_HOURS": "Non è possibile effettuare la prenotazione per le ${bookingTime} del ${bookingTime} in quanto l’orario richiesto è fuori dall’orario di servizio.",
        "NO_RESERVATION_NO_AVAILABILITY": "Purtroppo per il ${bookingDate}  alle ${bookingTime} non abbiamo posti disponibili in quanto siamo al completo.",
        "NO_RESERVATION_OUT_OF_BOOKING_WINDOW": "Non è possibile effettuare la prenotazione per le ${bookingTime} del ${bookingTime} in quanto l’orario richiesto è fuori dall’orario di servizio. E’ possibile prenotare solo tra ${bookingStartTime} e ${bookingEndTime}.",
        "NO_RESERVATION_OUT_OF_BOOKING_WINDOW_LUNCH_DINNER": "Il ristorante non è disponibile per la prenotazione al ${bookingTime} il ${bookingDate} perché l'orario richiesto è fuori dall'orario di servizio. La prenotazione è disponibile solo nei seguenti orari: ${formattedTimeSlotsString}.",
        "NO_RESERVATION_NO_SEAT": "Purtroppo per il ${bookingDate}  alle ${bookingTime} non abbiamo posti disponibili in quanto siamo al completo.",
        "RESTAURANT_CLOSED": "Ora siamo chiusi.",
        "RESTAURANT_OPEN": "Ora siamo aperti. ",
        "RESTAURANT_CLOSED_W_INFO": "Ora siamo chiusi. Siamo  aperti per pranzo dalle  ${lunchOpen}  alle ${lunchClose}  e per cena dalle ${dinnerOpen}  alle ${dinnerClose}.",
        "FORMAT_EXISTING_BOOKINGS": "Selezioni la sua prenotazione dal seguente elenco. Per esempio dica uno per la prima prenotazione , due per la seconda.",
        "BOOKING_NOT_UPDATED": "Purtroppo per un problema tecnico non sono riuscito ad aggiornare la sua prenotazione. Mi scuso per il disguido e la prego di riprovare più tardi. ",
        "INVALIDATE_BOOKING_DATE": "Ha fornito una data passata per la prenotazione.",
        "NO_HOLIDAY": "Non ci sono festività o periodi di vacanza  imminenti.",
        "FORMAT_HOLIDAY": "Queste sono le prossime festività: ${holidays.name } il ${holidays.date }.",
        "BOOKING_FOUND_W_PHONE": "Ho trovato la sua prenotazione associata al numero di telefono ${customerPhone}.",
        "BOOKING_NOT_FOUND_W_PHONE": "Purtroppo non sono riuscito a trovare la prenotazione associata al numero di telefono ${customerPhone}.",
        "BOOKING_FOUND_W_DATE": "È stata trovata la prenotazione con la data di prenotazione ${bookingDate}.",
        "BOOKING_NOT_FOUND_W_DATE": "La prenotazione con la data di prenotazione ${bookingDate} non è stata trovata.",
        "BOOKING_FOUND_W_EMAIL": "Ho trovato la sua prenotazione associata all’ e-mail ${bookingEmail}.",
        "BOOKING_NOT_FOUND_W_EMAIL": "Purtroppo non sono riuscito a trovare la prenotazione associata all’ e-mail ${bookingEmail}. ",
        "BOOKING_FOUND_W_NAME": "Ho trovato la sua prenotazione associata al nome ${bookingName}.",
        "BOOKING_NOT_FOUND_W_NAME": "Purtroppo non sono riuscito a trovare la prenotazione associata al nome ${bookingName}.",
        "BOOKING_FOUND_W_RESERVATION_NUMBER": "Ho trovato la sua prenotazione con il numero ${reservation_number}.",
        "BOOKING_NOT_FOUND_W_RESERVATION_NUMBER": "Purtroppo non sono riuscito a trovare la prenotazione numero ${reservationNumber}.",
        "FORMAT_BOOKING_CANCELLATION_MODIFICATION": "Ecco le opzioni che abbiamo trovato per la tua prenotazione: ${formattedBookingOptions}, seleziona solo quella che contiene le tue informazioni.",
        "CANCELLATION_CONFIRMATION": "La tua prenotazione è per le persone ${partySize} il ${bookingDate} alle ${startTime}. Vuoi confermare la cancellazione?"
    }
}